app/serializers/api_serializers.rb

  def booking(booking, include_experience: true)
    return nil unless booking

    data = {
      id: booking.id,
      reference: booking.reference,
      status: booking.status,
      guests: booking.guests,
      starts_on: booking.starts_on,
      ends_on: booking.ends_on,
      amount_cents: booking.amount_cents,
      amount: booking.amount,
      currency: booking.currency,
      commission_cents: booking.commission_cents,
      commission: booking.commission,
      notes: booking.notes,
      client: client(booking.client),
      room_type: room_type(booking.room_type),
      room: room(booking.room),
      created_at: booking.created_at
    }
    if include_experience && booking.experience
      data[:experience] = experience(booking.experience)
      data[:experience][:hotel][:has_active_retreats] = booking.experience.hotel.retreats.exists? if data[:experience][:hotel]
    end
    if booking.hotel_id && !booking.experience_id
      data[:hotel] = hotel(booking.hotel)
      data[:hotel][:has_active_retreats] = booking.hotel.retreats.exists?
---
SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = 1 LIMIT 1