app/controllers/api/v1/bookings_controller.rb

SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = 1 LIMIT 1
---
      def set_booking
        @booking = current_organization.bookings.includes(:experience, :client).find(params[:id])