app/controllers/api/v1/bookings_controller.rb

      def create
        booking = current_organization.bookings.new(booking_params)
        booking.save!
---
INSERT INTO "bookings" ("organization_id", "experience_id", "client_id", "reference", "guests", "starts_on", "ends_on", "status", "amount_cents", "currency", "commission_cents", "notes", "created_at", "updated_at") VALUES (2, 1, NULL, 'HMN-NV27WL', 2, '2026-05-12', '2026-05-19', 'inquiry', 1048000, 'USD', 125760, NULL, '2026-06-02 20:23:52.152247', '2026-06-02 20:23:52.152247') RETURNING "id"

      def set_booking
        @booking = current_organization.bookings.includes(:hotel, :client, :room_type, :room, experience: :hotel).find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 1
SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = 1 LIMIT 1