app/controllers/api/v1/clients_controller.rb

      def create
        client = current_organization.clients.create!(client_params)
---
INSERT INTO "clients" ("organization_id", "name", "email", "phone", "notes", "created_at", "updated_at") VALUES (2, 'Tomás Vidal', 'tomas@example.com', NULL, NULL, '2026-06-02 20:23:52.125183', '2026-06-02 20:23:52.125183') RETURNING "id"