app/controllers/api/v1/coverage_controller.rb

SELECT "experiences"."country_code", "experiences"."country", COUNT(*), COUNT(*) FILTER (WHERE experiences.status = 'active'), AVG(hotels.latitude), AVG(hotels.longitude) FROM "experiences" INNER JOIN "hotels" ON "hotels"."id" = "experiences"."hotel_id" WHERE "experiences"."status" IN ('active', 'upcoming') GROUP BY "experiences"."country_code", "experiences"."country"
---
      def index
        rows = Experience.published
                         .in_enabled_country
                         .joins(:hotel)
                         .group(:country_code, :country)
                         .pluck(
                           :country_code,
                           :country,
                           Arel.sql("COUNT(*)"),
                           Arel.sql("COUNT(*) FILTER (WHERE experiences.status = 'active')"),
                           Arel.sql("AVG(hotels.latitude)"),
                           Arel.sql("AVG(hotels.longitude)")
                         )