app/controllers/api/v1/experiences_controller.rb

        scope = Experience.published
                          .includes(:hotel)
                          .by_kind(params[:kind])
                          .in_country(params[:country])
                          .search(params[:q])
                          .order(:starts_on)

        render json: {
          experiences: paginate(scope).map { |e| ApiSerializers.experience(e) },
          meta: meta_for(scope)
---
SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" IN (2, 4)
SELECT "experiences".* FROM "experiences" WHERE "experiences"."status" IN ('active', 'upcoming') AND "experiences"."kind" = 'masterclass' ORDER BY "experiences"."starts_on" ASC LIMIT 20 OFFSET 0

      def show
        exp = Experience.includes(:hotel).find_by(slug: params[:id]) ||
              Experience.includes(:hotel).find(params[:id])
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."slug" = 'ubud-roots' LIMIT 1
SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = 4