app/controllers/api/v1/invitations_controller.rb

          )
        end

        unless user.save
---
INSERT INTO "users" ("organization_id", "email", "password_digest", "name", "role", "locale", "last_login_at", "created_at", "updated_at", "status", "avatar_url", "phone", "onboarding_completed_at") VALUES (2, 'qatest@demo.com', '$2a$12$u8S7Ux1JWIrclgt9TOfGEOuPFh9LvwCFcWo2L7Xkykj68.LRciuoa', 'QA Test User', 'member', 'en', NULL, '2026-07-07 11:59:50.947837', '2026-07-07 11:59:50.947837', 'active', NULL, NULL, NULL) RETURNING "id"

          return
        end

        @invitation.update!(accepted_at: Time.current)
---
UPDATE "invitations" SET "accepted_at" = '2026-07-07 02:29:25.109128', "updated_at" = '2026-07-07 02:29:25.115259' WHERE "invitations"."id" = 1

      def set_invitation
        @invitation = Invitation.find_by!(token: params[:token])
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."token" = 'w91EdXMnSuaDIKVn_hWW0p-krX1vbnAaHkYrIybVDBU' LIMIT 1