app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE (lower(email) = 'agent@viajeseter.com') LIMIT 1
---
      def create
        user = User.find_by("lower(email) = ?", login_params[:email].to_s.strip.downcase)