app/controllers/api/v1/admin/countries_controller.rb

INSERT INTO "countries" ("name", "code", "flag_emoji", "status", "enabled", "region", "currency_code", "timezone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
        def create
          country = Country.new(country_params)
          if country.save

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
UPDATE "countries" SET "name" = $1, "updated_at" = $2 WHERE "countries"."id" = $3  [["name", "Spain"], ["updated_at", "2026-07-07 11:39:50.421247"], ["id", 26]]
---
        def update
          country = Country.find(params[:id])
          if country.update(country_params)

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
DELETE FROM "countries" WHERE "countries"."id" = $1  [["id", 27]]
---
        def destroy
          country = Country.find(params[:id])
          country.destroy!