app/controllers/api/v1/admin/invitations_controller.rb

          scope = Invitation.includes(:organization, :invited_by)
---
SELECT MIN("organizations"."created_at") FROM "organizations"
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" IN (26, 24, 27, 25)

        def resend
          invitation = Invitation.find(params[:id])

          if invitation.accepted?
            return render_unprocessable("Invitation was already accepted.")
          end

          # Reset expiry
          invitation.update!(expires_at: 7.days.from_now)
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."id" = 15 LIMIT 1
UPDATE "invitations" SET "expires_at" = '2026-07-15 20:02:42.163441', "updated_at" = '2026-07-08 20:02:42.268203' WHERE "invitations"."id" = 15

        def serialize_invitation(inv)
          {
            id: inv.id,
            email: inv.email,
            role: inv.role,
            organization: {
              id: inv.organization.id,
              name: inv.organization.name,
              kind: inv.organization.kind,
              city: inv.organization.city,
              country: inv.organization.country,
            },
            invited_by: inv.invited_by&.name || inv.invited_by&.email,
            accepted_at: inv.accepted_at,
            expires_at: inv.expires_at&.iso8601,
            created_at: inv.created_at.iso8601,
            expired: inv.expired? && !inv.accepted?,
          }
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 24 LIMIT 1