app/controllers/api/v1/admin/organizations_controller.rb

          scope = Organization.where.not(kind: "admin")
---
SELECT MIN("organizations"."created_at") FROM "organizations"

        def create
          org = Organization.new(organization_params)
          org.save!
---
INSERT INTO "organizations" ("name", "kind", "status", "city", "country", "country_code", "contact_email", "website", "created_at", "updated_at", "legal_name", "phone", "primary_contact", "tax_id", "description", "logo_url", "specialties", "onboarding_completed_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

        def update
          @organization.update!(organization_params)
---
UPDATE "organizations" SET "name" = $1, "updated_at" = $2 WHERE "organizations"."id" = $3  [["name", "Updated Agency"], ["updated_at", "2026-07-07 02:54:29.595123"], ["id", 49]]

        def destroy
          @organization.destroy!
---
DELETE FROM "organizations" WHERE "organizations"."id" = $1  [["id", 55]]

        def set_organization
          @organization = Organization.find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT $2  [["id", 55], ["LIMIT", 1]]

        def serialize_org(org)
          ApiSerializers.organization(org).merge(
            contact_email: org.contact_email,
            user_count: org.users.count,
            legal_name: org.legal_name,
            business_name: org.business_name,
            tax_id: org.tax_id,
            primary_contact: org.primary_contact,
            primary_contact_role: org.primary_contact_role,
            commercial_registration: org.commercial_registration,
            phone: org.phone,
            website: org.website,
            social_links: org.social_links || {},
            ownership_document_url: org.ownership_document_url,
            authorization_declared_at: org.authorization_declared_at&.iso8601
          )
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" IN (26, 24, 27, 25)
SELECT COUNT(*) FROM "users" WHERE "users"."organization_id" = 6
SELECT MIN("organizations"."created_at") FROM "organizations"