app/controllers/api/v1/admin/retreats_controller.rb

SELECT "retreat_images".* FROM "retreat_images" WHERE "retreat_images"."retreat_id" = $1  [["retreat_id", 10]]
---
          scope = Retreat.includes(:hotel, :retreat_images)

SELECT "retreats".* FROM "retreats" ORDER BY "retreats"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 20], ["OFFSET", 0]]
---
          scope = scope.search(params[:q]) if params[:q].present?

          retreats = paginate(scope.order(created_at: :desc))
          render json: {
            retreats: retreats.map { |r| ApiSerializers.retreat(r, include_details: false) },
            meta: meta_for(scope)

SELECT "retreats".* FROM "retreats" WHERE "retreats"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
        def approve
          retreat = Retreat.find(params[:id])

SELECT "retreats".* FROM "retreats" WHERE "retreats"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "retreats" SET "status" = $1, "updated_at" = $2 WHERE "retreats"."id" = $3  [["status", "closed"], ["updated_at", "2026-07-07 11:39:07.922249"], ["id", 14]]
---
        def close
          retreat = Retreat.find(params[:id])
          retreat.update!(status: "closed")