app/controllers/api/v1/admin/stats_controller.rb

        def index
          from_date = params[:from].present? ? Date.parse(params[:from]) : nil
          to_date   = params[:to].present?   ? Date.parse(params[:to])   : nil

          # Only count organizations that have at least one user
          orgs = Organization.where.not(kind: "admin")
                              .where("EXISTS (SELECT 1 FROM users WHERE users.organization_id = organizations.id)")
          bookings = Booking.all

          if from_date
            orgs = orgs.where("organizations.created_at >= ?", from_date.beginning_of_day)
            bookings = bookings.where("bookings.created_at >= ?", from_date.beginning_of_day)
          end
          if to_date
            orgs = orgs.where("organizations.created_at <= ?", to_date.end_of_day)
            bookings = bookings.where("bookings.created_at <= ?", to_date.end_of_day)
          end

          agencies = orgs.where(kind: "agency").count
          hotels   = orgs.where(kind: "hotel").count
          booking_count = bookings.count
          gmv_cents = bookings.sum(:amount_cents)

          # Pending counts per kind (not filtered by date range, only orgs with users)
          has_users = "EXISTS (SELECT 1 FROM users WHERE users.organization_id = organizations.id)"
          pending_agencies = Organization.where(kind: "agency", status: "pending").where(has_users).count
---
SELECT MIN("organizations"."created_at") FROM "organizations"
SELECT COUNT(*) FROM "organizations" WHERE "organizations"."kind" != 'admin' AND "organizations"."kind" = 'office'
SELECT COUNT(*) FROM "bookings" WHERE (bookings.created_at >= '2026-06-08 00:00:00') AND (bookings.created_at <= '2026-07-08 23:59:59.999999')
SELECT SUM("bookings"."amount_cents") FROM "bookings" WHERE (bookings.created_at >= '2026-06-08 00:00:00') AND (bookings.created_at <= '2026-07-08 23:59:59.999999')
SELECT COUNT(*) FROM "organizations" WHERE "organizations"."kind" != 'admin' AND "organizations"."status" = 'pending'