app/controllers/api/v1/admin/subscriptions_controller.rb

SELECT "subscriptions".* FROM "subscriptions" ORDER BY "subscriptions"."created_at" DESC LIMIT 20 OFFSET 0
---
          scope = scope.by_status(params[:status]) if params[:status].present?

          subs = paginate(scope.order(created_at: :desc))
          render json: {
            subscriptions: subs.map { |s| ApiSerializers.subscription(s) },
            meta: meta_for(scope)