app/controllers/api/v1/admin/subscription_plans_controller.rb

INSERT INTO "subscription_plans" ("name", "slug", "price_cents", "currency", "billing_interval", "features", "commission_rate", "stripe_price_id", "active", "trial_days", "position", "target_audience", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
        def create
          plan = SubscriptionPlan.new(plan_params)
          if plan.save

SELECT "subscription_plans".* FROM "subscription_plans" WHERE "subscription_plans"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "subscription_plans" SET "name" = $1, "updated_at" = $2 WHERE "subscription_plans"."id" = $3  [["name", "Starter"], ["updated_at", "2026-07-07 11:39:07.964140"], ["id", 9]]
---
        def update
          plan = SubscriptionPlan.find(params[:id])
          if plan.update(plan_params)