app/controllers/api/v1/admin/users_controller.rb

          scope = scope.includes(:organization).order("users.created_at DESC")
          meta = meta_for(scope)

          paginated = paginate(scope)

          # Look up invitations to find who invited each user
          emails = paginated.map(&:email)
          invitations_by_email = Invitation.where(email: emails)
            .includes(invited_by: :organization)
            .index_by(&:email)

          render json: {
            users: paginated.map { |u|
              data = ApiSerializers.user(u).merge(status: u.status)
              inv = invitations_by_email[u.email]
              if inv&.invited_by&.organization
                org = inv.invited_by.organization
                data[:invited_by_organization] = {
                  id: org.id,
                  name: org.name,
                  kind: org.kind
                }
              end
              if inv
                data[:invitation_id] = inv.id
                data[:invitation_accepted] = inv.accepted_at.present?
                data[:invited_at] = inv.created_at&.iso8601
---
SELECT MIN("organizations"."created_at") FROM "organizations"
SELECT "invitations".* FROM "invitations" WHERE "invitations"."email" IN ('jguidi.info@gmail.com', 'jonaawtf@gmail.com', 'office@humana.global', 'hotel@casadelfaro.com', 'agent@viajeseter.com')
INSERT INTO "organizations" ("name", "kind", "status", "city", "country", "country_code", "contact_email", "website", "created_at", "updated_at", "legal_name", "phone", "primary_contact", "tax_id", "description", "logo_url", "specialties", "onboarding_completed_at") VALUES ('Test Agency', 'agency', 'pending', NULL, NULL, NULL, NULL, NULL, '2026-07-08 14:25:54.733367', '2026-07-08 14:25:54.733367', NULL, NULL, NULL, NULL, NULL, NULL, '{}', NULL) RETURNING "id"
INSERT INTO "invitations" ("email", "token", "role", "organization_id", "invited_by_id", "accepted_at", "expires_at", "created_at", "updated_at") VALUES ('test@demo.com', 'w91EdXMnSuaDIKVn_hWW0p-krX1vbnAaHkYrIybVDBU', 'member', 2, 1, NULL, '2026-07-09 02:29:24.622717', '2026-07-07 02:29:24.634729', '2026-07-07 02:29:24.634729') RETURNING "id"

        def invite
          inv_params = params.require(:invitation).permit(:email, :role, :organization_id, :org_name, :org_kind, :assigned_office_id, :country_code)
          email = inv_params[:email].to_s.strip.downcase
          role = inv_params[:role] || "owner"

          # Guard: reject if a non-pending user already exists with this email
          existing_user = User.find_by("LOWER(email) = ?", email)
          if existing_user && existing_user.status != "pending"
            return render json: { error: "already_registered", message: "This email is already registered." }, status: :unprocessable_entity
          end

          # Guard: reject if a pending (non-expired) invitation already exists
          existing_invitation = Invitation.pending.where("LOWER(email) = ?", email).first
          if existing_invitation
            return render json: { error: "already_invited", message: "An invitation has already been sent to this email." }, status: :unprocessable_entity
          end

          # Find or create the organization for this user.
          # organization_id → join an existing org (e.g. office role).
          # org_kind + org_name → create a brand-new org (agency/hotel).
          org = if inv_params[:organization_id].present?
                  Organization.find(inv_params[:organization_id])
---
SELECT "users".* FROM "users" WHERE (LOWER(email) = 'jonaawtf@gmail.com') LIMIT 1
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 2 LIMIT 1

                    country_record = Country.find_by(code: inv_params[:country_code].upcase)
                    org_attrs[:country] = country_record&.name || inv_params[:country_code]
                  end
                  new_org = Organization.create!(org_attrs)
---
INSERT INTO "organizations" ("name", "kind", "status", "city", "country", "country_code", "contact_email", "website", "created_at", "updated_at", "legal_name", "phone", "primary_contact", "tax_id", "description", "logo_url", "specialties", "onboarding_completed_at") VALUES ('Test Agency', 'agency', 'pending', NULL, NULL, NULL, NULL, NULL, '2026-07-08 14:25:54.733367', '2026-07-08 14:25:54.733367', NULL, NULL, NULL, NULL, NULL, NULL, '{}', NULL) RETURNING "id"

            organization: org,
            invited_by: current_user
          )
          invitation.save!

          # Also create a pending User so it appears in the admin network list
          temp_password = SecureRandom.hex(16)
          user = User.find_or_create_by!(email: email) do |u|
---
INSERT INTO "invitations" ("email", "token", "role", "organization_id", "invited_by_id", "accepted_at", "expires_at", "created_at", "updated_at") VALUES ('test@demo.com', 'w91EdXMnSuaDIKVn_hWW0p-krX1vbnAaHkYrIybVDBU', 'member', 2, 1, NULL, '2026-07-09 02:29:24.622717', '2026-07-07 02:29:24.634729', '2026-07-07 02:29:24.634729') RETURNING "id"
INSERT INTO "users" ("organization_id", "email", "password_digest", "name", "role", "locale", "last_login_at", "created_at", "updated_at", "status", "avatar_url", "phone", "onboarding_completed_at") VALUES (9, 'jonaawtf@gmail.com', '$2a$12$7AItkeHYTJAKy1WWzdyJBexz7NI3kQNtfzSTGVJ/trrQjx.XRwG7a', 'Jonaawtf', 'owner', 'en', NULL, '2026-07-08 14:07:41.462232', '2026-07-08 14:07:41.462232', 'pending', NULL, NULL, NULL) RETURNING "id"

          # - Office invites anyone → stays pending (requires admin review)
          inviter_is_admin = current_user.organization.admin?
          if inviter_is_admin && org.kind != "hotel"
            user.update!(status: "active")
---
UPDATE "users" SET "updated_at" = '2026-07-09 20:09:41.731920', "status" = 'rejected' WHERE "users"."id" = 15

        def approve
          @user.update!(status: "active")
---
UPDATE "users" SET "updated_at" = '2026-07-08 14:08:49.414375', "status" = 'active' WHERE "users"."id" = 9

        def reject
          reason = params[:reason].to_s.strip
          @user.update!(status: "rejected")
---
UPDATE "users" SET "updated_at" = '2026-07-09 20:09:41.731920', "status" = 'rejected' WHERE "users"."id" = 15

        def suspend
          @user.update!(status: "suspended")
---
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2026-07-07 02:54:29.763545"], ["status", "suspended"], ["id", 39]]

        def reactivate
          @user.update!(status: "active")
---
UPDATE "users" SET "updated_at" = $1, "status" = $2 WHERE "users"."id" = $3  [["updated_at", "2026-07-07 02:54:29.777108"], ["status", "active"], ["id", 41]]