app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def current_user
    return @current_user if defined?(@current_user)

    @current_user = User.find_by(id: token_payload&.dig(:sub))