app/models/booking.rb

SELECT 1 AS one FROM "bookings" WHERE "bookings"."reference" = 'HMN-HIMJDD' LIMIT 1
---
  def assign_reference
    return if reference.present?

    loop do
      candidate = "HMN-#{SecureRandom.alphanumeric(6).upcase}"
      next if Booking.exists?(reference: candidate)