app/controllers/api/v1/hotel/base_controller.rb

        def current_hotel
          @current_hotel ||= current_organization.hotels.first
---
SELECT "hotels".* FROM "hotels" WHERE "hotels"."organization_id" = 3 ORDER BY "hotels"."id" ASC LIMIT 1